Revit 2027 API
IFCExtrusionCalculatorUtils Methods
The IFCExtrusionCalculatorUtils type exposes the following members.
Methods
Name | Description
CalculateExtrusionData(IFCExtrusionCalculatorOptions, GeometryObject) |  Calculates the extrusion data from a Revit geometry object.
CalculateExtrusionData(IFCExtrusionCalculatorOptions, IList<Face>)
Top
See Also
Reference
IFCExtrusionCalculatorUtils Class
Autodesk.Revit.DB.IFC Namespace